<template>
  <div class="container faq"> 
    <h2 class="faq-title">Часто задаваемые вопросы о фермерских продуктах</h2>
    <ul class="faq-list">
      <li v-for="(question, index) in faqList" :key="index">
        <h3 @click="toggleAnswer(index)">{{ question.title }}</h3>
        <p class="faq-answer" v-if="question.showAnswer">{{ question.answer }}</p>
      </li>
    </ul>
  </div>
</template>

<script setup>
import { ref } from 'vue';

const faqList = ref([
      {
        title: 'Что такое фермерские продукты?',
        answer: 'Фермерские продукты - это продукты питания, выращенные фермерами без использования химических удобрений и пестицидов, с учетом принципов устойчивого земледелия.',
      },
      {
        title: 'Какие преимущества у фермерских продуктов?',
        answer: 'Фермерские продукты обычно свежие и более питательные, так как они проходят меньше обработки и не содержат добавок и консервантов.',
      },
      {
        title: 'Где можно приобрести фермерские продукты?',
        answer: 'Фермерские продукты можно приобрести на фермерских рынках, в сельскохозяйственных кооперативах или у фермеров напрямую.',
      },
      {
        title: 'Как узнать, что продукты действительно фермерские?',
        answer: 'Лучший способ узнать, что продукты являются фермерскими, - спросить у продавца о методах выращивания и происхождении продуктов.',
      },
      {
        title: 'Какую пользу приносит фермерам покупка их продуктов?',
        answer: 'Покупка фермерских продуктов напрямую у фермеров помогает им получать более справедливую цену за свой труд и поддерживает местное сельское хозяйство.',
      },
      {
        title: 'Можно ли доверять сертификатам на фермерские продукты?',
        answer: 'Сертификаты на фермерские продукты могут быть полезны, но не всегда являются гарантией качества. Лучше всего узнать больше о конкретных фермерах и их методах выращивания.',
      },
      {
        title: 'Какую роль играют фермерские продукты в устойчивом развитии?',
        answer: 'Фермерские продукты способствуют устойчивому развитию, так как они обычно выращиваются с учетом экологических и социальных аспектов, что помогает сохранять биоразнообразие и поддерживать местные сообщества.',
      },
]);

function toggleAnswer(index) {
  faqList.value[index].showAnswer = !faqList.value[index].showAnswer;
}
</script>

<style lang="scss" scoped>

.faq{
  margin-top: 50px  
}
.faq-title{
  font-size: 52px;
  font-weight: 600;
  line-height: 1.1;
}

.faq-list li {
  cursor: pointer;
  color: black;
  padding: 15px;
  margin: 15px 0;
  background-color: #e5e7eb;
  border-radius: 0.375rem;
}

.faq-answer{
  margin: 15px 0 0 0;
}

</style>
